In [23]:
import os

In [5]:
import pandas as pd

In [24]:
os.chdir(r'C:\Users\shmi2002\OneDrive')

In [25]:
os.getcwd()

'C:\\Users\\shmi2002\\OneDrive'

In [6]:
pd.read_excel(r'C:\Users\shmi2002\Documents\python data set\py1.xlsx')

   name city  pin
0  dave  vad   32
1   sam  ahm   23
2  troy  sur   11

In [13]:
pd.read_csv(r"C:\Users\shmi2002\py2.tsv",sep='\t')

    Name  Phone no. batchno.
0  ALLEN   98070890  aksjn22
1    bob   28731971  kjasb28
2  Suzan   87231937  naksj21